settings.org
#+TITLE: Emacs Settings

* Emacs packages repo
** repo
#+BEGIN_SRC emacs-lisp
(require 'package)
(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                    (not (gnutls-available-p))))
       (proto (if no-ssl "http" "https")))
  ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired
  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
  (when (< emacs-major-version 24)
    ;; For important compatibility libraries like cl-lib
    (add-to-list 'package-archives '("gnu" . (concat proto "://elpa.gnu.org/packages/")))))
(package-initialize)
#+END_SRC
** use-package
This package downloads and install packages from melpa and elpa
#+BEGIN_SRC emacs-lisp
(require 'use-package)
#+END_SRC
* UI settings
** Turn off menu bar
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
#+END_SRC
** set font
#+BEGIN_SRC emacs-lisp
  (set-default-font "Fira Mono 11")
#+END_SRC
** theme
#+BEGIN_SRC emacs-lisp
  (use-package doneburn-theme
    :ensure t
    :config (load-theme 'doneburn 'no-confirm))
#+END_SRC
** which-key
which-key adds popup with avinable keybindings
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :config (which-key-mode))
#+END_SRC
* Org mode
* Evil mode
